run/crossFlow/constant/air/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         multiComponentMixture;
    transport       sutherland;
    thermo          janaf;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

species
(
	N2
	O2
);

inertSpecie N2;

N2
{
    specie
    {
        molWeight       28.0134;
        nElectrons      0;
        rSign		0;
        hForm		0;
        sForm		191.609;
        stoiCoeff       0;
    }
    thermodynamics
    {
        Tlow            250;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.92664 0.0014879768 -5.68476e-07 1.0097038e-10 -6.753351e-15 -922.7977 5.980528 );
        lowCpCoeffs     ( 3.298677 0.0014082404 -3.963222e-06 5.641515e-09 -2.444854e-12 -1020.8999 3.950372 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    
}

O2
{
    specie
    {
        molWeight       31.9988;
        nElectrons      4;
        rSign		-1;
        hForm		0;
        sForm		205.152;
        stoiCoeff       0.5;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 3.28253784 0.00148308754 -7.57966669e-07 2.09470555e-10 -2.16717794e-14 -1088.45772 5.45323129 );
        lowCpCoeffs     ( 3.78245636 -0.00299673416 9.84730201e-06 -9.68129509e-09 3.24372837e-12 -1063.94356 3.65767573 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }

}

activation
{
    type  butlerVolmer;
    gamma   1.51556e+8;
    E     E     [1 2 -2 0 1 0 0]    1.3986e+5;
    alpha   0.65;
    relax   1;

    entries
    {
        O2 
        {
             stoichiometricCoeff 0.22;
             active true;
        }              
        N2 
        {
            stoichiometricCoeff 0.0;
            active false;
        }              
    }
}

// ************************************************************************* //
