run/crossFlow/constant/electroChemProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      electroChemProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// V=1.0  @ j=1000
// V=0.95 @ j=2000
// V=0.9  @ j=3000
// V=0.85 @ j=4000
// V=0.8  @ j=5000
// V=0.75 @ j=6000
// V=0.7  @ j=7000

// run mode
// true ==> galvanostatic
// false ==> potentiostatic
//
galvanostatic true;

// voltage
// galvanostatic ==> initial value
// potentiostaic ==> prescribed value
//
voltage         0.80;         // volts

// mean current density
// galvanostatic ==> prescribed value
// potentiostaic ==> initial value
//
jbar0           5000.0;    // amperes/m^2

// available fuel cell types: SOFC / HTPEFC
fuelCellType    SOFC;

// voltage correction relaxation coefficient for galvanostatic run
//
Rhat            1.0e-5;    // ohm m^2
Rhat0           1.0e-5;   // ohm m^2, relaxation coefficient during pre-iteration for voltage correction
// pre-iteration
PreIterAct      0;    //pre-iteration for actvation term
PreIterV        0;    //pre-iteration for voltage correction
relax           0.1;    //relaxation parameter added SBB

// initial Temperature for fuel and air T fields
Tinit		1000.0;	  // K

numCells	1;	  

zRnx		2.0;          // the number of electrons transferred per fuel molecule in reaction

// ************************************************************************* //
