run/crossFlow/constant/fuel/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         multiComponentMixture;
    transport       sutherland;
    thermo          janaf;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

species
(
	H2
	H2O
);

inertSpecie H2O;

H2
{
    specie
    {
        molWeight       2.01594;
        nElectrons      2;
        rSign		-1;
        hForm		0;
        sForm		130.680;
        stoiCoeff       1;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 3.3372792 -4.94024731e-05 4.99456778e-07 -1.79566394e-10 2.00255376e-14 -950.158922 -3.20502331 );
        lowCpCoeffs     ( 2.34433112 0.00798052075 -1.9478151e-05 2.01572094e-08 -7.37611761e-12 -917.935173 0.683010238 );
    }
    transport
    {
        As              6.362e-07;
        Ts              72;
    }
}

H2O
{
    specie
    {
        molWeight       18.01534;
        nElectrons      2;
        rSign		1;
        hForm		-241.8349e3;
        sForm		188.835;
        stoiCoeff       1;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 3.03399249 0.00217691804 -1.64072518e-07 -9.7041987e-11 1.68200992e-14 -30004.2971 4.9667701 );
        lowCpCoeffs     ( 4.19864056 -0.0020364341 6.52040211e-06 -5.48797062e-09 1.77197817e-12 -30293.7267 -0.849032208 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
}

activation
{
    type  butlerVolmer;
    gamma   1.82527e+6;
    E     E     [1 2 -2 0 1 0 0]    105.04e+3;
    alpha   0.59;
    relax   1;

    entries
    {
        H2O
        {
            stoichiometricCoeff 0.33;
            active true;
        }

        H2
        {
            stoichiometricCoeff -0.1;
            active true;
        }
    }
}
// ************************************************************************* //
