run/crossFlow/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  5;

method              simple;

simpleCoeffs
{
    n 		(1 $numberOfSubdomains 1);
    delta	0.001;
}

hierarchicalCoeffs
{
    n 		(1 1 1);
    delta 	0.001;
    order 	xyz;
}

manualCoeffs
{
    dataFile	"";
}

distributed	no;

roots
(
);

constraints
{
    //- Keep owner and neighbour on same processor for faces in zones:
    faces
    {
        type    preserveFaceZones;
        zones   (eletrolyte fuel air);
    }
}



// ************************************************************************* //
