run/crossFlow/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Interconnect_bottom
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.0 0.0 0.0) (100.0e-3 100.0e-3 3.499e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 0.0 3.499e-3) (100.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (1.0e-3 0.0 3.499e-3) (3.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (5.0e-3 0.0 3.499e-3) (7.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (9.0e-3 0.0 3.499e-3) (11.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (13.0e-3 0.0 3.499e-3) (15.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (17.0e-3 0.0 3.499e-3) (19.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (21.0e-3 0.0 3.499e-3) (23.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (25.0e-3 0.0 3.499e-3) (27.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (29.0e-3 0.0 3.499e-3) (31.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (33.0e-3 0.0 3.499e-3) (35.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (37.0e-3 0.0 3.499e-3) (39.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (41.0e-3 0.0 3.499e-3) (43.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (45.0e-3 0.0 3.499e-3) (47.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (49.0e-3 0.0 3.499e-3) (51.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (53.0e-3 0.0 3.499e-3) (55.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (57.0e-3 0.0 3.499e-3) (59.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (61.0e-3 0.0 3.499e-3) (63.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (65.0e-3 0.0 3.499e-3) (67.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (69.0e-3 0.0 3.499e-3) (71.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (73.0e-3 0.0 3.499e-3) (75.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (77.0e-3 0.0 3.499e-3) (79.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (81.0e-3 0.0 3.499e-3) (83.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (85.0e-3 0.0 3.499e-3) (87.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (89.0e-3 0.0 3.499e-3) (91.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (93.0e-3 0.0 3.499e-3) (95.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (97.0e-3 0.0 3.499e-3) (99.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    interconnect0;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     interconnect0CellSet;
    }

    // Air
    {
        name    airCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.0 0.0e-3 4.999e-3) (100.0e-3 100.0e-3 5.2849e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (1.0e-3 0.0 3.499e-3) (3.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (5.0e-3 0.0 3.499e-3) (7.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (9.0e-3 0.0 3.499e-3) (11.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (13.0e-3 0.0 3.499e-3) (15.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (17.0e-3 0.0 3.499e-3) (19.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (21.0e-3 0.0 3.499e-3) (23.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (25.0e-3 0.0 3.499e-3) (27.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (29.0e-3 0.0 3.499e-3) (31.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (33.0e-3 0.0 3.499e-3) (35.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (37.0e-3 0.0 3.499e-3) (39.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (41.0e-3 0.0 3.499e-3) (43.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (45.0e-3 0.0 3.499e-3) (47.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (49.0e-3 0.0 3.499e-3) (51.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (53.0e-3 0.0 3.499e-3) (55.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (57.0e-3 0.0 3.499e-3) (59.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (61.0e-3 0.0 3.499e-3) (63.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (65.0e-3 0.0 3.499e-3) (67.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (69.0e-3 0.0 3.499e-3) (71.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (73.0e-3 0.0 3.499e-3) (75.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (77.0e-3 0.0 3.499e-3) (79.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (81.0e-3 0.0 3.499e-3) (83.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (85.0e-3 0.0 3.499e-3) (87.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (89.0e-3 0.0 3.499e-3) (91.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (93.0e-3 0.0 3.499e-3) (95.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    airCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (97.0e-3 0.0 3.499e-3) (99.0e-3 100.0e-3 4.999e-3);
    }
    {
        name    air;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     airCellSet;
    }

    // Electrolyte
    {
        name    electrolyteCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.0 0.0 5.2849e-3) (100.0e-3 100.0e-3 5.2931e-3);
    }
    {
        name    electrolyte;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     electrolyteCellSet;
    }
    
    // Fuel
    {
        name    fuelCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.0 0.0 5.2931e-3) (100.0e-3 100.0e-3 6.299e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 1.0e-3 6.299e-3) (100.0e-3 3.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 5.0e-3 6.299e-3) (100.0e-3 7.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 9.0e-3 6.299e-3) (100.0e-3 11.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 13.0e-3 6.299e-3) (100.0e-3 15.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 17.0e-3 6.299e-3) (100.0e-3 19.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 21.0e-3 6.299e-3) (100.0e-3 23.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 25.0e-3 6.299e-3) (100.0e-3 27.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 29.0e-3 6.299e-3) (100.0e-3 31.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 33.0e-3 6.299e-3) (100.0e-3 35.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 37.0e-3 6.299e-3) (100.0e-3 39.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 41.0e-3 6.299e-3) (100.0e-3 43.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 45.0e-3 6.299e-3) (100.0e-3 47.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 49.0e-3 6.299e-3) (100.0e-3 51.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 53.0e-3 6.299e-3) (100.0e-3 55.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 57.0e-3 6.299e-3) (100.0e-3 59.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 61.0e-3 6.299e-3) (100.0e-3 63.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 65.0e-3 6.299e-3) (100.0e-3 67.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 69.0e-3 6.299e-3) (100.0e-3 71.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 73.0e-3 6.299e-3) (100.0e-3 75.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 77.0e-3 6.299e-3) (100.0e-3 79.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 81.0e-3 6.299e-3) (100.0e-3 83.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 85.0e-3 6.299e-3) (100.0e-3 87.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 89.0e-3 6.299e-3) (100.0e-3 91.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 93.0e-3 6.299e-3) (100.0e-3 95.0e-3 7.799e-3);
    }
    {
        name    fuelCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 97.0e-3 6.299e-3) (100.0e-3 99.0e-3 7.799e-3);
    }    
    {
        name    fuel;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     fuelCellSet;
    }
    
    // Interconnect_top
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.0 0.0e-3 7.799e-3) (100.0e-3 100.0e-3 11.3e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0.0 0.0 6.299e-3) (100.0e-3 100.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 1.0e-3 6.299e-3) (100.0e-3 3.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 5.0e-3 6.299e-3) (100.0e-3 7.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 9.0e-3 6.299e-3) (100.0e-3 11.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 13.0e-3 6.299e-3) (100.0e-3 15.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 17.0e-3 6.299e-3) (100.0e-3 19.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 21.0e-3 6.299e-3) (100.0e-3 23.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 25.0e-3 6.299e-3) (100.0e-3 27.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 29.0e-3 6.299e-3) (100.0e-3 31.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 33.0e-3 6.299e-3) (100.0e-3 35.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 37.0e-3 6.299e-3) (100.0e-3 39.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 41.0e-3 6.299e-3) (100.0e-3 43.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 45.0e-3 6.299e-3) (100.0e-3 47.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 49.0e-3 6.299e-3) (100.0e-3 51.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 53.0e-3 6.299e-3) (100.0e-3 55.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 57.0e-3 6.299e-3) (100.0e-3 59.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 61.0e-3 6.299e-3) (100.0e-3 63.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 65.0e-3 6.299e-3) (100.0e-3 67.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 69.0e-3 6.299e-3) (100.0e-3 71.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 73.0e-3 6.299e-3) (100.0e-3 75.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 77.0e-3 6.299e-3) (100.0e-3 79.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 81.0e-3 6.299e-3) (100.0e-3 83.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 85.0e-3 6.299e-3) (100.0e-3 87.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 89.0e-3 6.299e-3) (100.0e-3 91.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 93.0e-3 6.299e-3) (100.0e-3 95.0e-3 7.799e-3);
    }
    {
        name    interconnect1CellSet;
        type    cellSet;
        action  delete;
        source  boxToCell;
        box     (0.0 97.0e-3 6.299e-3) (100.0e-3 99.0e-3 7.799e-3);
    }    
    {
        name    interconnect1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     interconnect1CellSet;
    }   
    
);


// ************************************************************************* //
